org-content/notes-lecture-VirTheo.org
#+title: 400A - Virial theorem
#+author: Mathieu Renzo
#+email: mrenzo@arizona.edu
#+PREVIOUS_PAGE: notes-lecture-EOS1.org
#+NEXT_PAGE: notes-lecture-EOS2.org

*Materials*: Chapter 2 of Onno Pols' lecture notes, Chapter 3 of
Kippenhahn's book, Sec. 1.5 of "Tapestry of Modern Astrophysics" by S.
N. Shore, pages 134-139 Clayton's book.

* Virial theorem
In the [[./notes-lecture-EOS1.org][previous lecture]], we have discussed that it is appropriate to
use thermodynamics to describe the /local/ properties of the stellar
gas. We had already established that (self-)gravity determines the
pressure gradient in the star through the hydrostatic equilibrium
equation (which is just the particular form that momentum conservation
takes in a stellar context). Therefore, in this lecture we will
explore the relation there may be between gravitational physics and
thermodynamics which will allow us to get some crucial facts about
stars.

The virial theorem relates the kinetic and potential energy of system
of point masses interacting through long-range forces, and thus allows
one to *connect thermodynamics and gravitational physics*. It is a
statistical statement on mutually interacting particles (e.g., because
of their mutual gravity!), and thus it is very general. The etymology
of the name comes from "vir" which is latin for "forces".

