html-content/notes-lecture-VirTheo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-25 Tue 09:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>400A - Virial theorem</title>
<meta name="author" content="Mathieu Renzo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./css/style.css" />
<link rel="stylesheet" href="./fontawesome-free-6.7.2-web/css/all.min.css">
<meta name="keywords" content="Mathieu, Renzo, Mathieu Renzo,
			       stellar evolution, 400A, University of
			       Arizona, Steward Observatory, stars,
			       theoretical astrophysics">
</head>
<body>
<div id="preamble" class="status">
<!-- Preamble -->
<!-- The header -->
<div class="header">

  <!-- The site name -->
  <div class="site-name">
    <a id="top" href="./index.html">Stellar Evolution</a>
  </div>

  <!-- The hamburger -->
  <div class="hamburger">
    <div id="myLinks" class="menu">
      <a href="./index.html">Home</a>
      <a href="./syllabus.html">Syllabus</a>
      <a href="./lectures.html">Lectures</a>
      <a href="./projects.html">Projects</a>
    </div>
    <a  href="javascript:void(0);" class="icon" onclick="HamburgerMenuFunction()">
      <i class="fa fa-bars"></i>
    </a>
  </div>

  <div class="navbar">
    <a href="./syllabus.html">Syllabus</a>
    <a href="./lectures.html">Lectures</a>
    <a href="./projects.html">Projects</a>
  </div>
</div>

<!-- scripts -->
<script>
  function HamburgerMenuFunction() {
      var x = document.getElementById("myLinks");
      if (x.style.display === "block") {
	  x.style.display = "none";
      } else {
	  x.style.display = "block";
      }
  }
</script>

<script>
  window.onload = () => {
      const toggleButton = document.getElementById("light-dark-toggle");
      const body = document.body;
      const html = document.documentElement;


      // Check localStorage for user preference
      if (localStorage.getItem("theme") === "dark") {
          body.classList.add("dark-mode");
	  html.classList.toggle("dark-mode");
      }

      // Toggle theme on click
      toggleButton.addEventListener("click", () => {
          body.classList.toggle("dark-mode");
	  html.classList.toggle("dark-mode");

          // Save user preference
          if (body.classList.contains("dark-mode")) {
              localStorage.setItem("theme", "dark");
          } else {
              localStorage.setItem("theme", "light");
          }
      });
  };
</script>
<!-- end scripts-->
</div>
<div id="content" class="content">
<p>
<b>Materials</b>: Chapter 2 of Onno Pols' lecture notes, Chapter 3 of
Kippenhahn's book, Sec. 1.5 of "Tapestry of Modern Astrophysics" by S.
N. Shore, pages 134-139 Clayton's book.
</p>

<div id="outline-container-orge66f46a" class="outline-2">
<h2 id="orge66f46a"><a href="#orge66f46a">Virial theorem</a></h2>
<div class="outline-text-2" id="text-orge66f46a">
<p>
In the <a href="./notes-lecture-EOS1.html">previous lecture</a>, we have discussed that it is appropriate to
use thermodynamics to describe the <i>local</i> properties of the stellar
gas. We had already established that (self-)gravity determines the
pressure gradient in the star through the hydrostatic equilibrium
equation (which is just the particular form that momentum conservation
takes in a stellar context). Therefore, in this lecture we will
explore the relation there may be between gravitational physics and
thermodynamics which will allow us to get some crucial facts about
stars.
</p>

<p>
The virial theorem relates the kinetic and potential energy of system
of point masses interacting through long-range forces, and thus allows
one to <b>connect thermodynamics and gravitational physics</b>. It is a
statistical statement on mutually interacting particles (e.g., because
of their mutual gravity!), and thus it is very general. The etymology
of the name comes from "vir" which is latin for "forces".
</p>
</div>
