org-content/notes-lecture-VirTheo.org
** (Almost fully) General derivation
Let's start with a very general derivation (see for example
Goldstein's classical mechanics book or Shore's Tapesty of Modern
Astrophysics Sec. 1.5). For a collection of particles with (constant)
mass $m_{i}$, Netwon's second law states that the change in their
momentum is equal to the total force they are subject to:

#+begin_latex
\begin{equation}
 m_{i} \ddot{\mathbf{r_{}}_{i}} = \mathbf{F}_{i} \ \, .
\end{equation}
#+end_latex

Note that here $\mathbf{r}_{i}$ and $\mathbf{F}_{i}$ are vector quantities.
We take the /first-order spatial moment of this distribution/, which
means we take the dot product of each term by the position of the
particles and sum over all the particles. Why? The reason is to make
/something like the work done by forces (and thus the potential energy)
appear in the second term/:

#+begin_latex
\begin{equation}\label{eq:first_moment_second_law}
\sum_{i} m_{i}\ddot{\mathbf{r}_{i}} \cdot \mathbf{r}_{i} = \sum_{i} \mathbf{F}_{i} \cdot \mathbf{r}_{i} \ \ .
\end{equation}
#+end_latex

The r.h.s. looks like a sum of work done by the total foce on each
particle: $\sum_{i} \mathbf{F}_{i} \cdot \mathbf{r}_{i} \equiv W$. This is the so
called "virial", which contains only long-range forces between the
particles (collisions cancel out in the sum because of Netwon's 3^{rd}
law). This by conservation of energy has to be equal to the net
potential energy available $E_\mathrm{pot}$.

The l.h.s. can be re-written using the chain rule for the second
time-derivative:

#+begin_latex
\begin{equation}
\sum_{i} m_{i}\ddot{\mathbf{r}_{i}} \cdot \mathbf{r}_{i}  = \sum_{i} \frac{1}{2} m_{i} \frac{d^{2}}{dt^{2}}r_{i}^{2} - \sum_{i} m_{i} \cdot \dot{r_{i}}^{2}
\end{equation}
#+end_latex

And now we have on the right hand side (assuming the mass of the
particles to be constant) twice the second time derivative of the
moment of inertia $I = \sum_{i} m_{i} r_{i}^{2}$ and twice the kinetic energy
$E_\mathrm{kin} = \sum_{i }m_{i} v_{i}^{2}/2$ (because of course $v_{i} = \dot{r_{i}}$).
So putting the r.h.s. of this last equation in the first spatial
moment of Newton's second law (Eq. \ref{eq:first_moment_second_law})
we obtain:

#+begin_latex
\begin{equation}
 2\mathrm{E}_\mathrm{kin}+\mathrm{E}_\mathrm{pot} = \frac{1}{2}\ddot{I}
\end{equation}
#+end_latex

This is the general form of the Virial theorem derived by Clausius. In
general, in the virial theorem there is a second derivative of the
moment of inertia on the r.h.s., which is often forgotten. We did not
specify almost anything about the system (see Goldstein for a
momentum-based derivation where the assumption of constant masses m_{i}
of the particles implicit in the way we wrote Newton's second law is
not even needed).

The virial theorem effectively says that /for a bound system of
self-interacting particles/, /there is a limited amount of potential
energy that can be extracted/, because part of the potential will need
to go into the kinetic terms and the acceleration of the moment of
inertia.

So far, this general form doesn't give us much intuition on its
meaning. We have a relation between the kinetic energy of a collection
of particles, its potential energy, and the second time-derivative of
its moment of inertia. But in the frame of the center of mass of such
collection, the kinetic energy of the particles is a measure of their
thermal energy, and this is non-trivial: why would the thermal energy
know about the potential energy! This statement is however very
general and its implication for stellar structure and evolution are
profound.

