md/notes-lecture-VirTheo.md


<a id="org56ee5db"></a>

## Derivation for binary orbits

As a demonstration for the generality of the virial theorem, we can
apply it to a collection of particle with only 2 particles subject
only to the gravitational force, that is a binary system of two
point-mass stars on a Keplerian orbit!

One can write the total energy of the binary as:

<div class="latex" id="org6a7927d">
\begin{equation}
E_\mathrm{tot} = \mathrm{E_\mathrm{kin}}_{1} + \mathrm{E_\mathrm{kin}}_{2} + \mathrm{E}_\mathrm{pot} \equiv \mathrm{E_\mathrm{kin}} + \mathrm{E}_\mathrm{pot}  \equiv -\frac{GM_{1}M_{2}}{2a}  \ \ ,
\end{equation}

</div>

where in the last term we are using Kepler's laws. The gravitational
potential energy is $E_\mathrm{pot} = -GM_{1}M_{2}/a$, thus making it
explicit we obtain: $E_{kin} = |E_{pot}|/2$. Since Keplerian orbits in
Newtonian gravity are stable (energy losses through gravitational
waves make this statement not physically true, but this is only
relevant for close binaries of compact objects), this implies that the
second (and first) time-derivative of the moment of inertia of the
orbit is zero, and thus this *is* the virial theorem! *Keplerian binary
orbits are "virialized"*.

**N.B.:** Here we considered the case of just 2 particles, but nothing
stops us to consider $i=2...N$ with $N$ that can reach &sim; 10<sup>6</sup> and apply
the virial theorem to *clusters* of stars. Indeed, the virial theorem is
useful to initialize the positions and velocities of stars in a
simulated self-gravitating cluster such as globular clusters (the
question usually is whether the second-time derivative of the
cluster's moment of inertia can or cannot be approximated with zero).
