md/notes-lecture-VirTheo.md


<a id="org49aa6bc"></a>

## Derivation for stars

Let's now re-derive the Virial theorem for a star. Let's assume a
continuous description of the stellar gas, hydrostatic equilibrium and
spherical symmetry, and write explicitly the forces acting on each
shell $dr$ of gas (cf. hydrostatic momentum balance [seen before](notes-lecture-HSE.md)):

<div class="latex" id="org81d4f19">
\begin{equation}\label{eq:HSE}
\frac{dP}{dm} = -\frac{Gm}{4\pi r^{4}}
\end{equation}

</div>

By analogy with what is done in the general derivation above, we want
to make the gravitational potential appear on the r.h.s., which can be
done by multiplying by $4\pi r^{3}$ and integrating in $dm$ over the entire
mass of the star (from $0$ to $M$).

<div class="latex" id="org53f8d11">
\begin{equation}\label{eq:pot}
\int_{0}^{M} -\frac{Gm}{4\pi r^{4}} \times 4\pi r^{3} dm  = \int_{0}^{M} -\frac{Gm}{r}dm \equiv - \mathrm{E}_\mathrm{pot} \ \ .
\end{equation}

</div>

(so that $E_{_\mathrm{pot}}=|\int_{0}^{M} -Gm/r dm| >0$). The l.h.s. becomes integrating per parts

<div class="latex" id="org2657991">
\begin{equation}
\int_{0}^{M} \frac{dP}{dm} 4\pi r^{3} dm = \left[ 4\pi r^{3}P \right]^{M}_{0}- 3\int_{0}^{M}4\pi r^{2} \frac{\partial r}{\partial m} Pdm \ \ ,
\end{equation}

</div>

where the first term is zero: $P(M)=0$ at the outer surface of the star,
and in the center $r=0$ by definition. For the second term, we can use
the mass continuity equation and obtain $-3\int_{0}^{M} P/\rho dm$, thus, putting
back the pieces together:

<div class="latex" id="orgc2e8d6c">
\begin{equation}\label{eq:vir}
\int_{0}^{M }\frac{Gmdm}{r} = 3\int_{0}^{M} \frac{P}{\rho} dm \ \ .
\end{equation}

</div>

Note that if we had kept a non-zero $\rho \ddot{\mathbf{r}}$ term in Eq.
\ref{eq:HSE}, we would again obtain a term depending on the moment of
inertia and the bulk kinetic energy of the stellar gas (see for
example sec. 4.2.1 in Shore's "Tapestry of modern astrophysics"). From
Eq. \ref{eq:pot}, we have already interpreted the l.h.s. of Eq.
\ref{eq:vir} as the gravitational potential energy normalized to zero
at infinity.

Let's interpret the r.h.s., which in the general derivation would be
part of the $\sum_{i} \mathbf{F}_{}\cdot \mathbf{r}_{i}$ term. By dimensional
analysis we know it has to have the dimension of an energy. In fact,
still by dimensional analysis we can infer that [P/&rho;] = [E]/[L<sup>3</sup>] /
[M]/[L<sup>3</sup>] = [E]/[M] has the units of a specific energy (i.e., energy
per unit mass), and thus $P/\rho \propto u$ with $u \equiv u_\mathrm{int}$ specific
internal energy. Let's rewrite this as $u = \Phi P/\rho$ with $\Phi$ unknown
dimensionless constant.

To specify &Phi;, let's consider the second law of thermodynamics per unit
mass: *the heat exchanged by a gas* ($dq$) *is equal to the change in
internal energy* ($du$) *plus the work done* ($Pdv$, with $v$ the specific
volume, i.e. the volume per unit mass). We can use this to *define* the
specific entropy $s$, and also re-write this in terms of density instead
of specific volume $v$=(1 mass unit)/&rho; &rArr; $dv = -d\rho/\rho^{2}$:

<div class="latex" id="org2c74544">
\begin{equation}\label{eq:second_thermodynamics_law}
dq = Tds = du + Pdv = du -\frac{P}{\rho^{2}}d\rho \ \ ,
\end{equation}

</div>

We want to derive a relation between $u$, $P$, and &rho;. We are
considering the momentum conservation (Eq. \ref{eq:HSE}), so something
related to dynamics (which acts fast compared to thermal processes &#x2013;
you can verify this comparing timescales after the end of this
lecture!), therefore let's consider an adiabatic process where by
definition there is no heat exchange. Thus, $dq=0$ and $du = P/\rho^{2}
d\rho$.

Now by differentiating $u = \Phi P/\rho$ we get $du = \Phi (dP/\rho - P/\rho^{2} d\rho)
\equiv P/\rho^{2} d\rho$ (where we use Eq. \ref{eq:second_thermodynamics_law} with
$dq=0$ in the last step), that can be re-arranged into $\Phi/(1+\Phi) dP/P =
d\rho/\rho$, or in other words $(1+\Phi)/\Phi = d \log(P)/d \log(\rho) \equiv \Gamma_{1}$ because the
derivative has to be taken assuming no heat exchange, that is at
constant entropy, so that is by definition the first adiabatic index
$\Gamma_{1}$. Ultimately, we can put all this together and write

<div class="latex" id="orgff098e5">
\begin{equation}
\frac{P}{\rho} = (\Gamma-1)u \ \ ,
\end{equation}

</div>

where $\Gamma\equiv\Gamma_{1}$ is the first adiabatic index.

Finally, substituting in the first-order moment of the hydrostatic
equilibrium Eq. \ref{eq:vir} equation we have:

<div class="latex" id="org132e788">
\begin{equation}
3\int_{0}^{M} \frac{P}{\rho} dm = 3\int_{0}^{M} (\Gamma-1)u dm \ \ .
\end{equation}

</div>

Assuming that $\Gamma$ is constant throughout the star, we can take the
parenthesis out of the integral. We can define $E_\mathrm{int} = \int_{0}^{M} u dm$
and rewrite the above as $3(\Gamma-1)E-\mathrm{int}$, and thus

<div class="latex" id="orge6f5842">
\begin{equation}\label{eq:virial_star}
- E_\mathrm{pot} = 3(\Gamma-1)E_\mathrm{int}
\end{equation}

</div>

For a monoatomic gas where each particle has 3 degrees of freedom
(motion in 3 direction, no internal degrees of freedom for
point-particles), $\Gamma = 5/3$, and we obtain $|E_\mathrm{pot}| = 2
E_\mathrm{int}$ where the internal energy is due to the thermal motion
of gas, in agreement with the general form assuming hydro-*static*
equilibrium (&rArr; $d^{2} I/dt^{2} =0$).

Now lets define the total energy of the gas: $E_\mathrm{tot} =
E_\mathrm{pot} + E_\mathrm{int}$. For a star to be bound,
$E_\mathrm{tot}<0$. Because of the virial theorem in Eq.
\ref{eq:virial_star}, we can rewrite this as

<div class="latex" id="orga84fad8">
\begin{equation}
\mathrm{E}_\mathrm{tot} = \mathrm{E}_\mathrm{pot}\frac{3\Gamma-4}{3(\Gamma-1)} \equiv -(3\Gamma-4)\mathrm{E}_\mathrm{int}\ \ .
\end{equation}

</div>

Again, for a monoatomic gas with $\Gamma=5/3$ we recover $E_\mathrm{tot} =
E_\mathrm{pot}/2$, the total energy is half of the gravitational
binding energy!
