org-content/notes-lecture-VirTheo.org
*** Stability criterion
From the form of $E_\mathrm{tot}\equiv E_\mathrm{tot}(E_\mathrm{int})$,
since $E_\mathrm{int}$ is a quantity that is always non-negative by
definition (think thermal energy!), we see that for the star to be
bound, that is $E_\mathrm{tot}<0$, then a necessary condition is
$\Gamma>4/3$. One can immediately see that if $\Gamma <4/3$, then
$E_\mathrm{tot}$ changes sign. If $E_\mathrm{tot}>0$ the stellar gas
is unbound: the kinetic energy due to thermal motion is sufficient to
overcome the gravitational potential and the gas will fly out.

One can encounter cases in stellar evolution where $\Gamma\le 4/3$ (e.g.,
because of recombination that changes the mean molecular weight or
pair-production). In general though $\Gamma$ is /not/ constant throughout the
star as we assumed to pull the $\Gamma-1$ factor out of the integral. In
physical situations where $\Gamma\leq 4/3$ this typically occurs first /locally/
somewhere in the star, and there can be a /local/ rearrangement of the
stellar gas that prevents catastrophic consequences. However, this
local rearrangements are not always sufficient or even possible, and
sometimes /global/ consequences of the impossibility of stability occur:
for example the theorized (pulsational) pair instability supernovae
where a (very) massive star is completely obliterated and leaves
behind no black hole.

:Question:
- *Q*: for a star made only of photons, what is $\Gamma$? *Hint*: think of the
  $P\equiv P(u_{})$ relation!
:end:

