html-content/notes-lecture-VirTheo.html

<div id="outline-container-org535496c" class="outline-4">
<h4 id="org535496c"><a href="#org535496c">Stability criterion</a></h4>
<div class="outline-text-4" id="text-org535496c">
<p>
From the form of \(E_\mathrm{tot}\equiv E_\mathrm{tot}(E_\mathrm{int})\),
since \(E_\mathrm{int}\) is a quantity that is always non-negative by
definition (think thermal energy!), we see that for the star to be
bound, that is \(E_\mathrm{tot}<0\), then a necessary condition is
\(\Gamma>4/3\). One can immediately see that if \(\Gamma <4/3\), then
\(E_\mathrm{tot}\) changes sign. If \(E_\mathrm{tot}>0\) the stellar gas
is unbound: the kinetic energy due to thermal motion is sufficient to
overcome the gravitational potential and the gas will fly out.
</p>

<p>
One can encounter cases in stellar evolution where \(\Gamma\le 4/3\) (e.g.,
because of recombination that changes the mean molecular weight or
pair-production). In general though \(\Gamma\) is <i>not</i> constant throughout the
star as we assumed to pull the \(\Gamma-1\) factor out of the integral. In
physical situations where \(\Gamma\leq 4/3\) this typically occurs first <i>locally</i>
somewhere in the star, and there can be a <i>local</i> rearrangement of the
stellar gas that prevents catastrophic consequences. However, this
local rearrangements are not always sufficient or even possible, and
sometimes <i>global</i> consequences of the impossibility of stability occur:
for example the theorized (pulsational) pair instability supernovae
where a (very) massive star is completely obliterated and leaves
behind no black hole.
</p>

<ul class="org-ul">
<li><b>Q</b>: for a star made only of photons, what is \(\Gamma\)? <b>Hint</b>: think of the
\(P\equiv P(u_{})\) relation!</li>
</ul>
</div>
</div>
