org-content/notes-lecture-VirTheo.org
*** Use of gravitational energy in a star: negative heat capacity
Let's consider a star made of a perfect mono-atomic gas with $\Gamma=5/3$.
Let's say that for some reason this star is contracting (e.g., because
it is in its formation process). Let's assume this contraction is
quasi-static, meaning that at any point in time the hydrostatic
equilibrium assumption holds, and all the bulk motion of the gas is
very slow compared to thermal velocities, that is $v\ll v_{th} = (2k_{B}T/m)^{1/2}$,
and thus also highly sub-sonic, $v\ll c_\mathrm{sound}$.

The contraction increases the gravitational potential energy
$E_\mathrm{pot} \propto GM^{2}/R$ since $M$ is by assumption constant and $R$
decreases. The total energy $E_\mathrm{tot}$ also increases, but only
by half the amount that the gravitational potential increases. The
other half goes into internal thermal energy of the gas because of the
Virial theorem! This is the limit in the amount of work that can be
extracted set by the virial theorem mentioned above.

For an ideal  gas, the internal energy is related to the
mean temperature by
#+begin_latex
\begin{equation}
E_\mathrm{int} = \frac{\# \mathrm{degrees\ of\ freedom}}{2}Nk_{B}\langle T \rangle
\end{equation}
#+end_latex
where $N = \int \rho/(\mu m_{u})dV = M/(\mu m_{u})$ is the number of particles, with
$\mu$ mean molecular weight assumed to be constant, $\langle T \rangle$ is the
average temperature in the star, and the number of degrees of freedom
is 3 for a monoatomic gas. From the Virial theorem it follows that:

#+begin_latex
\begin{equation}
E_\mathrm{int} = - \frac{E_\mathrm{pot}}{2} \Rightarrow \frac{3}{2} \frac{M}{\mu m_{u}} k_{B}\langle T \rangle = C \frac{GM^{2}}{R} \ \ ,
\end{equation}
#+end_latex
where $C = \{\int_{0}^{M} Gmdm/r\}/\{GM^{2}/R\}$ is a constant of $\mathcal{O}(1)$
that depends on the mass distribution in the star. Thus:
#+begin_latex
\begin{equation}
\langle T \rangle = \frac{2\mu m_{u}}{3 k_{B}} C \frac{GM^{}}{R} \propto \frac{\mu M}{R} \ \ .
\end{equation}
#+end_latex
From this equation, several important facts follow for any
self-gravitating star in hydrostatic equilibrium:

- the mean temperature of a star depends only on its mass $M$ and radius $R$
  (and chemical composition through \mu);
- /as a star contracts/ ($R$ decreases at constant mass $M$), /the
  temperature must rise/! This, as we will see, governs the evolution
  of stars.
- A self-gravitating collection of particle with finite temperature
  must radiate away energy, thus it will lose energy. This energy
  loss, since $E_\mathrm{tot} = |E_\mathrm{pot}|/2 = - CGM^{2}/2R <0$ implies that $R$ must
  decrease. But then, $\langle T \rangle$ must increase! This is the "gravothermal"
  collapse of a cloud/star. As thermal energy is lost to radiation at
  the surface, the (average) temperature raises! This is why stars can
  be thought of objects with /negative/ heat capacity: it heats up as it
  loses energy! This is a property typical of self-gravitating systems
  only (stars and gravitationally bound stellar clusters) and because
  of the virial theorem it does not violate energy conservation.
- The gravothermal collapse must go on until either:
  1. an internal energy source, compensating for the surface energy loss kicks in, or
  2. the ideal gas approximation does not hold anymore.
  As we will see, both 1. and 2. occur in nature: 1. is the typical option for
  stars using nuclear fusion as internal energy source to delay the
  collapse, and 2. is what occurs for white dwarfs, where quantum
  mechanical effects stop the collapse.

Thus, /gravity determines not only the structure (through the
hydrostatic equilibrium equation) but also the evolution of a star/. It
dictates that as the star loses energy, it must heat up. Because of
this, at some point nuclear fusion can occur (as we will discuss
later): /stars don't shine because they burn, stars burn because they
shine/. Without the loss of (internal/thermal) energy by radiation they
would not contract, without contracting they would not reach
temperatures high enough to do nuclear fusion. *The nuclear fusion is a
consequence of the fact that stars shine, and not the cause*. Stars
shine as any object with finite temperature must do.

Internal energy sources such as nuclear fusion ultimately only delay
the gravothermal collapse of the stars until either the ideal gas
approximation does not hold (for white dwarfs) or even nuclear fusion
cannot stop the collapse, and gravity wins, leading to a supernova
explosion and/or the formation of a black hole.

