org-content/notes-lecture-VirTheo.org
** Kelvin-Helmholtz timescale
This is by definition the timescale it takes a star to radiate away
all its internal energy at a constant rate in absence of any other
energy sources. Note that this is a /global/ timescale for the whole
star!

Let's call L the "luminosity of the star", that is the rate at which
is loses energy from radiating away photons at its surface. Note that
L has the units of power [L] = [E]/[t].

Then by definition:
#+begin_latex
\begin{equation}\label{eq:tau_KH}
\tau_\mathrm{KH} = \frac{\mathrm{E}_\mathrm{int}}{L} \equiv
\frac{\mathrm{E}_\mathrm{pot}}{2L} \simeq \frac{GM^{2}}{2RL} \ \ ,
\end{equation}
#+end_latex
where we have used the virial theorem and set $C\simeq1$. We can scale all
the quantities to Solar values and obtain:
#+begin_latex
\begin{equation}\label{eq:KH_timescale_scaling}
\tau_{KH} \simeq 1.57 \times 10^{7} \mathrm{years} \times \left(\frac{M}{M_{\odot}}\right)^{2} \left(\frac{R}{R_{\odot}}\right)^{-1 }\left(\frac{L}{L_{\odot}}\right)^{-1} \ \ .
\end{equation}
#+end_latex
Clearly $\tau_{KH} \gg \tau_{ff}$, and also $\gg$ {human timescales}: it is hard to
get direct observational evidence that stars are in thermal
equilibrium. In fact, the name of this timescale comes from proposals
in the late 19^{th} century by Kelvin and Helmholtz that the Sun may be
out of thermal equilibrium and contracting, meaning it would have a
lifetime of the order of \sim 10 million years -- this was in contrast
with geological evidence (and with the timescale necessary for
Darwinian evolution), leading to a great debate that was ultimately
settled with the discovery of nuclear energy as a potential source of
energy in the 1930s (by primarily [[https://en.wikipedia.org/wiki/Hans_Bethe][Hans Bethe]] and collaborators), see G.
Shaviv "Life of stars" for a detailed discussion.

:Question:
- *Q*: A star may lose energy also by means other than photons,
  especially neutrinos. If such energy losses are important, how can
  we modify Eq. \ref{eq:tau_KH}?
:end:

* Homework

Using the virial theorem:
- Estimate the average temperature of the Sun and compare it with its
  surface temperature. Is the Sun in global thermal equilibrium? (you
  can assume C\sim1 in the notation used in class/in my notes, or use the
  mass and radius profile from the =MESA-web= model you already computed
  to calculate a more precise value for C)
- Find an order of magnitude (\sim) relation between the average sound
  speed in the star and the escape velocity (assume the star is made
  of ideal gas of temperature \langle T \rangle).
- Demonstrate that if a binary loses instantaneously an amount of mass
  greater than half the total mass of the binary, \Delta M \ge (M_{1}+M_{2})/2,
  then the orbit is unbound. This can happen when a supernova goes off
  in a binary (cf. [[https://ui.adsabs.harvard.edu/abs/1961BAN....15..265B/abstract][Blaauw 1961]])!
- determine a condition for the minimum mass of a gas cloud to
  collapse as a function of its temperature and density (*Hint*:
  collapse \Leftrightarrow d^{2} I/dt^{2}<0)

Using the model of the 1M_{\odot} star computed earlier with =MESA-web=:
- use one profile file to plot \Gamma_{1}\equiv\Gamma_{1}(m) for a Sun-like star
  of roughly the same age as the Sun. Label the age of the star for
  the corresponding profile.

