html-content/notes-lecture-VirTheo.html

<div id="outline-container-org6c4e627" class="outline-3">
<h3 id="org6c4e627"><a href="#org6c4e627">Kelvin-Helmholtz timescale</a></h3>
<div class="outline-text-3" id="text-org6c4e627">
<p>
This is by definition the timescale it takes a star to radiate away
all its internal energy at a constant rate in absence of any other
energy sources. Note that this is a <i>global</i> timescale for the whole
star!
</p>

<p>
Let's call L the "luminosity of the star", that is the rate at which
is loses energy from radiating away photons at its surface. Note that
L has the units of power [L] = [E]/[t].
</p>

<p>
Then by definition:
</p>
<div class="latex" id="orgf3cde74">
\begin{equation}\label{eq:tau_KH}
\tau_\mathrm{KH} = \frac{\mathrm{E}_\mathrm{int}}{L} \equiv
\frac{\mathrm{E}_\mathrm{pot}}{2L} \simeq \frac{GM^{2}}{2RL} \ \ ,
\end{equation}

</div>
<p>
where we have used the virial theorem and set \(C\simeq1\). We can scale all
the quantities to Solar values and obtain:
</p>
<div class="latex" id="org8b0e541">
\begin{equation}\label{eq:KH_timescale_scaling}
\tau_{KH} \simeq 1.57 \times 10^{7} \mathrm{years} \times \left(\frac{M}{M_{☉}}\right)^{2} \left(\frac{R}{R_{☉}}\right)^{-1 }\left(\frac{L}{L_{☉}}\right)^{-1} \ \ .
\end{equation}

</div>
<p>
Clearly \(\tau_{KH} \gg \tau_{ff}\), and also \(\gg\) {human timescales}: it is hard to
get direct observational evidence that stars are in thermal
equilibrium. In fact, the name of this timescale comes from proposals
in the late 19<sup>th</sup> century by Kelvin and Helmholtz that the Sun may be
out of thermal equilibrium and contracting, meaning it would have a
lifetime of the order of &sim; 10 million years &#x2013; this was in contrast
with geological evidence (and with the timescale necessary for
Darwinian evolution), leading to a great debate that was ultimately
settled with the discovery of nuclear energy as a potential source of
energy in the 1930s (by primarily <a href="https://en.wikipedia.org/wiki/Hans_Bethe">Hans Bethe</a> and collaborators), see G.
Shaviv "Life of stars" for a detailed discussion.
</p>

<ul class="org-ul">
<li><b>Q</b>: A star may lose energy also by means other than photons,
especially neutrinos. If such energy losses are important, how can
we modify Eq. \ref{eq:tau_KH}?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6c76961" class="outline-2">
<h2 id="org6c76961"><a href="#org6c76961">Homework</a></h2>
<div class="outline-text-2" id="text-org6c76961">
<p>
Using the virial theorem:
</p>
<ul class="org-ul">
<li>Estimate the average temperature of the Sun and compare it with its
surface temperature. Is the Sun in global thermal equilibrium? (you
can assume C&sim;1 in the notation used in class/in my notes, or use the
mass and radius profile from the <code>MESA-web</code> model you already computed
to calculate a more precise value for C)</li>
<li>Find an order of magnitude (&sim;) relation between the average sound
speed in the star and the escape velocity (assume the star is made
of ideal gas of temperature &lang; T &rang;).</li>
<li>Demonstrate that if a binary loses instantaneously an amount of mass
greater than half the total mass of the binary, &Delta; M &ge; (M<sub>1</sub>+M<sub>2</sub>)/2,
then the orbit is unbound. This can happen when a supernova goes off
in a binary (cf. <a href="https://ui.adsabs.harvard.edu/abs/1961BAN....15..265B/abstract">Blaauw 1961</a>)!</li>
<li>determine a condition for the minimum mass of a gas cloud to
collapse as a function of its temperature and density (<b>Hint</b>:
collapse &hArr; d<sup>2</sup> I/dt<sup>2</sup>&lt;0)</li>
</ul>

<p>
Using the model of the 1M<sub>☉</sub> star computed earlier with <code>MESA-web</code>:
</p>
<ul class="org-ul">
<li>use one profile file to plot &Gamma;<sub>1</sub>&equiv;&Gamma;<sub>1</sub>(m) for a Sun-like star
of roughly the same age as the Sun. Label the age of the star for
the corresponding profile.</li>
</ul>
</div>
