html-content/notes-lecture-VirTheo.html

<div id="outline-container-orgf63dc6b" class="outline-3">
<h3 id="orgf63dc6b"><a href="#orgf63dc6b">The Sun with no energy sources</a></h3>
<div class="outline-text-3" id="text-orgf63dc6b">
<p>
Let's use <code>MESA-web</code> to revisit the late 19<sup>th</sup> century/early 20<sup>th</sup> century
debate on the age of the Earth/Sun. (Astro)physicists calculated the
Kelvin-Helmholtz timescale and assumed that this was the age of the
Sun (from Eq. \ref{eq:KH_timescale_scaling}). Geologists and
biologists instead argued for a much longer age.
</p>

<p>
Let's assume we know the age of the Earth to be 4.5&times;10<sup>9</sup> years (this is
what the geologist and biologists argued!), but let's assume, like
physicists had to before knowing nuclear physics, that there is no
internal energy source in the Sun. In <code>MESA-web</code>, there is a <code>Burning
Modifiers</code> option where you can disable energy release and chemical
evolution. Make a model of a 1M<sub>☉</sub> star without energy release
and/or chemical evolution, until 4.5&times;10<sup>9</sup> years, and plot an HR
diagram. Plot also the 1M<sub>☉</sub> star you ran previously (which should
have included the nuclear energy release and chemical evolution).
</p>

<p>
<b>N.B.:</b> we can make a computer code do whatever we want! <i>Never</i> take
computer simulations as ground truth, they are <i>at best</i> only as good as
the input!
</p>

<p>
Write a short paragraph answering the following:
</p>
<ul class="org-ul">
<li>Which agrees better with the observation of the real Sun at the
Earth's age?</li>
<li>What is its radius and how does it compare to the measured R<sub>☉</sub>?
(<b>hint</b>: you can plot the lines at constant radius on the HRD, or read
the outermost radius from the last <code>profile*.data</code> file you saved)</li>
<li>What is the average density of the model without energy generation?
(an order of magnitude estimate is sufficient for the purpose).</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <hr>
  <a href="#light-dark-toggle"><i id="light-dark-toggle"><i class="fa-solid fa-circle-half-stroke"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-EOS1.html"><i class="fa-solid fa-arrow-left" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#top"><i class="fa-solid fa-arrow-up" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-EOS2.html"><i class="fa-solid fa-arrow-right" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="https://github.com/mathren/stellar_phys_400A"><i class="fa-brands fa-github" style="font-size:16px"></i></a><hr>
  <br>
  Last updated on 25 March 2025 <br>
  Made with Emacs 28.1 - Org mode 9.5.2
  <br>
</div>
</div>
</body>
</html>
