md/notes-lecture-VirTheo.md


<a id="orgba6b3ce"></a>

## The Sun with no energy sources

Let's use `MESA-web` to revisit the late 19<sup>th</sup> century/early 20<sup>th</sup> century
debate on the age of the Earth/Sun. (Astro)physicists calculated the
Kelvin-Helmholtz timescale and assumed that this was the age of the
Sun (from Eq. \ref{eq:KH_timescale_scaling}). Geologists and
biologists instead argued for a much longer age.

Let's assume we know the age of the Earth to be 4.5&times;10<sup>9</sup> years (this is
what the geologist and biologists argued!), but let's assume, like
physicists had to before knowing nuclear physics, that there is no
internal energy source in the Sun. In `MESA-web`, there is a `Burning
Modifiers` option where you can disable energy release and chemical
evolution. Make a model of a 1M<sub>o</sub> star without energy release
and/or chemical evolution, until 4.5&times;10<sup>9</sup> years, and plot an HR
diagram. Plot also the 1M<sub>o</sub> star you ran previously (which should
have included the nuclear energy release and chemical evolution).

**N.B.:** we can make a computer code do whatever we want! *Never* take
computer simulations as ground truth, they are *at best* only as good as
the input!

Write a short paragraph answering the following:

-   Which agrees better with the observation of the real Sun at the
    Earth's age?
-   What is its radius and how does it compare to the measured R<sub>o</sub>?
    (**hint**: you can plot the lines at constant radius on the HRD, or read
    the outermost radius from the last `profile*.data` file you saved)
-   What is the average density of the model without energy generation?
    (an order of magnitude estimate is sufficient for the purpose).

